config.org
-*- mode: org -*-
#+STARTUP: overview
#+STARTUP: content

* Behind the scenes

From https://github.com/howardabrams/dot-files/blob/master/emacs.org

#+BEGIN_SRC emacs-lisp
  (defun ambrevar/reset-gc-cons-threshold ()
    (setq gc-cons-threshold (car (get 'gc-cons-threshold 'standard-value))))
  (setq gc-cons-threshold (* 64 1024 1024))
  (add-hook 'after-init-hook #'ambrevar/reset-gc-cons-threshold)

  (setq default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  (defun ambrevar/reset-file-name-handler-alist ()
    (setq file-name-handler-alist default-file-name-handler-alist))
  (add-hook 'after-init-hook #'ambrevar/reset-file-name-handler-alist)
#+END_SRC

#+BEGIN_SRC emacs-lisp
; (emacs-init-time)
#+END_SRC

* Minimal config

- Basic info
  - Change user name and email

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Benji Sparkes")
(setq user-mail-address "bsparkes@stanford.edu")
#+END_SRC

- To save buffer on losing focus

#+BEGIN_SRC emacs-lisp
  (add-hook 'focus-out-hook 'save-buffer)
#+END_SRC

- For saving history

#+BEGIN_SRC emacs-lisp
  (setq savehist-file "~/.emacs.d/savehist")
  (setq savehist-additional-variables
        '(buffer-name-history
          compile-command
          extended-command-history
          file-name-history
          kill-ring
          regexp-search-ring
          search-ring))
  (savehist-mode 1)
#+END_SRC

- By default Emacs will display its tooltips in a separate frame.
  - If you want to force Emacs to use the echo area exclusively, you can do that with this handy code snippet:

#+BEGIN_SRC emacs-lisp
  (tooltip-mode -1)
  (setq tooltip-use-echo-area t)
#+END_SRC

- Indentation

#+BEGIN_SRC emacs-lisp
  (setq indent-tabs-mode t
	tab-width 2
	)
#+END_SRC

- Yes and No

#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

- Misc
  - Turn down the time to echo keystrokes so I don't have to wait around for things to happen.
  - Dialog boxes are also a bit annoying, so just have Emacs use the echo area for everything.
  - Beeping is for robots, and I am not a robot.
  - Use a visual indicator instead of making horrible noises.
  - Oh, and always highlight parentheses.

#+BEGIN_SRC emacs-lisp
  (setq echo-keystrokes 0.1
	use-dialog-box nil
	visible-bell t)
#+END_SRC

- Setting locale

#+BEGIN_SRC emacs-lisp
  (set-locale-environment "en_GB.UTF-8")
  (setenv "LANG" "en_GB.UTF-8")
#+END_SRC


* General config

** Some startup settings

- Some startup settings

#+BEGIN_SRC emacs-lisp
  (desktop-save-mode)
  ;; Some display settings
  (setq-default indicate-empty-lines t)
  (when (not indicate-empty-lines)
    (toggle-indicate-empty-lines))
  (save-place-mode t)
  (global-visual-line-mode t)
  (setq-default line-spacing 2)
#+END_SRC

** Interface tweaks

- Font settings

#+BEGIN_SRC emacs-lisp
  ;; Font Settings
  (when (eq system-type 'darwin)
  ;; default Latin font (e.g. Input Mono)
  ;; Input is used to help with lag? It only has 4 different faces.
  (set-face-attribute 'default nil :family "Source Code Pro";"Operator Mono";"mononoki";"Hack";"IBM Plex Mono";"Input Mono"
  :height 150
  ))
  (setq-default mac-allow-anti-aliasing nil)
  (setq inhibit-compacting-font-caches t)
#+END_SRC

#+RESULTS:

- Disable the toolbar and the scroll bar

#+BEGIN_SRC emacs-lisp
  (tool-bar-mode -1)
  (toggle-scroll-bar -1)
#+END_SRC

- Set line wrapping

#+BEGIN_SRC emacs-lisp
  (setq-default fill-column 1024)
  (set-default 'truncate-lines nil)
#+END_SRC

- For killing the buffer I'm looking at, capitalised then does the default

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x k") 'kill-this-buffer)
  (global-set-key (kbd "C-x K") 'kill-buffer)
#+END_SRC

- For the mac

** Editing tweaks

- Editing
  - Delete selected text while typing

#+BEGIN_SRC emacs-lisp
(delete-selection-mode t)
#+END_SRC

- Enable subword for all programing modes

#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook 'subword-mode)
#+END_SRC

- Enable pretty syntax highlighting everywhere

#+BEGIN_SRC emacs-lisp
  (require 'font-lock)
  (setq font-lock-maximum-decoration t)
  (global-font-lock-mode t)
  (global-hi-lock-mode nil)
  (setq jit-lock-contextually t)
  (setq jit-lock-stealth-verbose t)
#+END_SRC

- Wrap lines automatically

#+BEGIN_SRC emacs-lisp
  (auto-fill-mode t)
#+END_SRC

- Indicate empty line

#+BEGIN_SRC emacs-lisp
  (setq-default show-trailing-whitespace t)
#+END_SRC

- Go to indentation on new line

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "RET") 'newline-and-indent)
#+END_SRC

** Background tweaks

- Change backup location and make some backup settings
  - From: http://pragmaticemacs.com/emacs/auto-save-and-backup-every-save/

#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  (setq
   backup-by-copying t       ; don't clobber symlinks
   kept-new-versions 10      ; keep 10 latest versions
   kept-old-versions 0       ; don't bother with old versions
   delete-old-versions t     ; don't ask about deleting old S versions
   version-control t         ; number backups
   vc-make-backup-files nil) ; backup version controlled files
#+END_SRC

Auto-save often
  - every 20 characters typed is the minimum

#+BEGIN_SRC emacs-lisp
(setq auto-save-interval 200)
#+END_SRC

- For recognising that sentences end with a single space

#+BEGIN_SRC emacs-lisp
  (setq sentence-end-double-space nil)
#+END_SRC

Show line-number in the mode line

#+BEGIN_SRC emacs-lisp
  (line-number-mode 1)
#+END_SRC

Show column-number in the mode line
#+BEGIN_SRC emacs-lisp
  (column-number-mode 1)
#+END_SRC

- For reloading bib files

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq mouse-wheel-follow-mouse 't)
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))

  ;; Move file to trash instead of removing.
  (setq-default delete-by-moving-to-trash t)

  (setq
   ;; inhibit-startup-message t         ; Don't show the startup message...
   ;; inhibit-startup-screen t          ; ... or screen
   cursor-in-non-selected-windows t  ; Hide the cursor in inactive windows
   echo-keystrokes 0.1               ; Show keystrokes right away, don't show the message in the scratch buffer
   ;; initial-scratch-message nil       ; Empty scratch buffer
   help-window-select t              ; Select help window so it's easy to quit it with 'q'
   )

  ;; This is rather radical, but saves from a lot of pain in the ass.
  ;; When split is automatic, always split windows vertically
  (setq split-height-threshold 0)
  (setq split-width-threshold nil)
#+END_SRC


* Packages, etc.
** use-package

#+BEGIN_SRC emacs-lisp
(setq use-package-always-ensure t)
#+END_SRC

** exec-path-from-shell

https://github.com/purcell/exec-path-from-shell

#+BEGIN_SRC emacs-lisp
;(when (memq window-system '(mac ns x))
;  (exec-path-from-shell-initialize))
#+END_SRC

** LaTeX

- Tells emacs where to find LaTeX.
#+BEGIN_SRC emacs-lisp
;(let ((my-path (expand-file-name "/usr/local/bin:/usr/local/texlive/2022/bin/universal-darwin")))
(let ((TeX-path (expand-file-name "/usr/local/bin:/usr/local/texlive/2023basic/bin/universal-darwin")))
  (setenv "PATH" (concat TeX-path ":" (getenv "PATH")))
  (add-to-list 'exec-path TeX-path))
#+END_SRC

- LaTeX Stuff
#+BEGIN_SRC emacs-lisp
(require 'auctex-latexmk)
(auctex-latexmk-setup)
#+END_SRC

- Use PDF mode by default
#+BEGIN_SRC emacs-lisp
  (setq-default TeX-PDF-mode t)
  ;; Make emacs aware of multi-file projects
  (setq-default TeX-master "master") ; All master files called "master".
  (setq-default TeX-master nil)

  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq TeX-save-query nil)
  (add-hook 'LaTeX-mode-hook 'visual-line-mode)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)   ; with AUCTeX LaTeX mode
  ;; (add-hook 'latex-mode-hook 'turn-on-reftex)   ; with Emacs latex mode
#+END_SRC

- ReFtex from https://piotrkazmierczak.com/2010/emacs-as-the-ultimate-latex-editor/

#+BEGIN_SRC emacs-lisp
  (setq reftex-plug-into-AUCTeX t)
  ;; Only change sectioning colour
  (setq font-latex-fontify-sectioning 'color)
  ;; Exclude bold/italic from keywords
  ;; (setq font-latex-deactivated-keyword-classes '("italic-command" "bold-command" "italic-declaration" "bold-declaration"))
  ;; TeX-electric-math
  (add-hook 'plain-TeX-mode-hook
	    (lambda () (set (make-variable-buffer-local 'TeX-electric-math)
			    (cons "$" "$"))))
  ;
  ;(add-hook 'LaTeX-mode-hook
  ;          (lambda () (set (make-variable-buffer-local 'TeX-electric-math)
  ;                          (cons "\\(" "\\)"))))
  ;(setq LaTeX-electric-left-right-brace t)
  (setq TeX-electric-sub-and-superscript t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq TeX-source-correlate-method 'synctex)
  (add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
#+END_SRC

- use Skim as default pdf viewer
  - Skim's displayline is used for forward search (from .tex to .pdf)
  - option -r relaods the file; option -b highlights the current line; option -g opens Skim in the background
  - For this to work, it seems one needs no spaces in the file name

#+BEGIN_SRC emacs-lisp
  (setq TeX-view-program-selection '((output-pdf "PDF Viewer")))
  (setq TeX-view-program-list
        '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -r -b -g %n %o %b")))
#+END_SRC

- Minted

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted)
#+END_SRC

-  Minted options

#+BEGIN_SRC emacs-lisp
(setq-default org-export-latex-minted-options
              '(("frame" "lines")
                ("fontsize" "\\scriptsize")
                ("linenos" "")))
#+END_SRC

