config.el

(use-package helm
  :ensure t
  ;; :init
  :config
  (setq
   helm-quick-update t ; do not display invisible candidates
   helm-idle-delay 0.01 ; be idle for this many seconds, before updating in delayed sources.
   helm-input-idle-delay 0.01 ; be idle for this many seconds, before updating candidate buffer
   helm-split-window-default-side 'other ;; open helm buffer in another window
   helm-split-window-in-side-p t ;; open helm buffer inside current window, not occupy whole other window
   helm-candidate-number-limit 100 ; limit the number of displayed canidates
   helm-move-to-line-cycle-in-source nil ; move to end or beginning of source when reaching top or bottom of source.
   ;; helm-command
   helm-M-x-requires-pattern 0     ; show all candidates when set to 0
   helm-M-x-fuzzy-match t ; optional fuzzy matching for helm-M-x
   )
  :bind (("C-c h" . helm-mini)
         ("C-h a" . helm-apropos)
         ("C-x C-b" . helm-buffers-list)
         ("C-x b" . helm-buffers-list)
         ("M-y" . helm-show-kill-ring)
         ("M-x" . helm-M-x)
         ("C-x c o" . helm-occur)
         ("C-x c s" . helm-swoop)
         ("C-x c b" . my/helm-do-grep-book-notes)
         ("C-x c SPC" . helm-all-mark-rings)
         ;; ("C-c h" .  helm-command-prefix)
         ("C-x C-f" . helm-find-files)
         ))

(add-hook 'after-init-hook 'global-company-mode)
(company-auctex-init)

(add-to-list 'company-backends 'company-math-symbols-unicode)
(add-to-list 'company-backends '(company-capf
                                 :with company-dabbrev))

(eval-after-load 'company
  '(progn
     (define-key company-mode-map (kbd "C-:") 'helm-company)
     (define-key company-active-map (kbd "C-:") 'helm-company)))

(setq-default company-dabbrev-downcase nil)

(which-key-mode)
(which-key-setup-minibuffer)
;; (setq which-key-popup-type 'minibuffer)
(setq which-key-idle-delay 0.1)
(setq which-key-max-display-columns nil)

(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

(require 'deft)
(setq deft-extensions '("txt" "tex" "org"))
(setq deft-directory "~/Dropbox/Docs/")
(setq deft-recursive t)
(setq deft-use-filename-as-title t)
(setq deft-use-filter-string-for-filename t)
(global-set-key (kbd "C-x C-\\") 'deft-find-file)

(require 'browse-kill-ring)

(require 'org)

(setq org-support-shift-select t)
(setq org-replace-disputed-keys t)

;; (add-hook 'org-mode-hook
;;  (lambda () (face-remap-add-relative 'default :family "Input Mono")))

(add-hook 'org-mode-hook 'LaTeX-math-mode)
(setq org-format-latex-options
      '(:foreground default
                    :background default
                    :scale 1
                    :html-foreground "Black"
                    :html-background "Transparent"
                    :html-scale 1.0
                    :matchers ("begin" "$1" "$$" "\\(" "\\[")))

(setq org-adapt-indentation nil)

;; (font-lock-add-keywords
;;  'org-mode
;;  '(("\\(@[0-9]*[-]*[0-9]*@\\)" 1 font-lock-comment-face t)))

;; (global-set-key "\C-cl" 'org-store-link)
;; (global-set-key "\C-ca" 'org-agenda)
;; (global-set-key "\C-cc" 'org-capture)
;; (global-set-key "\C-cb" 'org-iswitchb)

(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))

(setq org-agenda-files (file-expand-wildcards "~/Dropbox/Docs/Org/*.org"))

;; (setq-default org-todo-keywords '((sequence
;;                       "TODO(t)"
;;                       "FIXME(f)"
;;                       "IN-PROGRESS(p)"
;;                       "NEXT(n)"
;;                       "WAITING(w)"
;;                       "|"
;;                       "DONE(d)"
;;                       "COMPLETED(c)"
;;                       "CANCELLED(x)")))
;; (setq org-log-done t)

(setq org-log-done 'time)
(setq org-log-done 'note)

(setq  org-directory "~/Dropbox/Docs/Org")
(setq org-default-notes-file (concat org-directory "/OrgCapture.org"))

;; (setq org-src-fontify-natively t)

;; (defun my/org-mode-hook ()
;  "Stop the org-level headers from increasing in height relative to the other text."
;  (dolist (face '(org-level-1
;                  org-level-2
;                  org-level-3
;                  org-level-4
;                  org-level-5))
;    (set-face-attribute face nil :weight 'semi-bold :height 1.0))
;; )
;; (
;; add-hook 'org-mode-hook 'my/org-mode-hook)

(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (dot . t)
   (emacs-lisp . t)
   (js . t)
   (latex . t)
   (lisp . t)
   (org . t)
   (python . t)
   (R . t)
   (ruby . t)
   (scheme)
   ))

;; https://github.com/Fuco1/smartparens
(require 'smartparens-config)
(require 'smartparens-latex)
(smartparens-global-mode t)
(show-smartparens-global-mode t)

;; needed to ensure text isn't deleted
;; (https://github.com/Fuco1/smartparens/issues/834)
(define-key LaTeX-mode-map (kbd "$") 'self-insert-command)

(sp-with-modes
    '(tex-mode plain-tex-mode latex-mode LaTeX-mode)
  (sp-local-pair "\\(" "\\)"
		 :unless '(sp-latex-point-after-backslash)
		 :trigger-wrap "$"
		 :trigger "$"))

(global-set-key (kbd "C-x g") 'magit-status)

;; to get rid of buffer-face on shift click
(define-key global-map (kbd "<S-down-mouse-1>") 'mouse-save-then-kill)
;; to set right click to a menu bar instead of yanking
(global-set-key [mouse-2] 'mouse-popup-menubar-stuff)

;; Solves pointer problems?
; (if (daemonp)
;    (add-hook 'after-make-frame-functions
;              (lambda (frame)
;                (with-selected-frame frame
;                  (load-theme  'leuven t))))

(load-theme 'dracula t)

;; For loading themes
;; (defadvice load-theme (before theme-dont-propagate activate)
;;   (mapc #'disable-theme custom-enabled-themes))

(add-hook 'LaTeX-mode-hook 'display-line-numbers-mode)
(add-hook 'latex-mode-hook 'display-line-numbers-mode)
(add-hook 'js-mode-hook 'display-line-numbers-mode)

;; For multiple cursors
(use-package multiple-cursors
  :ensure t
  :bind (("C->" . mc/mark-next-like-this)
         ("C-<" . mc/mark-previous-like-this)
         ("C-c C->" . mc/mark-all-like-this)
         ("C-c C-SPC" . mc/edit-lines)
         ("M-<M-down-mouse-1>" . mc/add-cursor-on-click)
         ))
;; ;; (global-set-key (kbd "s-d") 'mc/mark-next-like-this)        ;; Cmd+d select next occurrence of region
;;  (global-set-key (kbd "s-D") 'mc/mark-all-dwim)              ;; Cmd+Shift+d select all occurrences
;;  (global-set-key (kbd "M-s-l") 'mc/edit-beginnings-of-lines) ;; Alt+Cmd+d add cursor to each line in region

(use-package undo-tree
  :ensure t
  :init
  (global-undo-tree-mode))
