config.org
** ispell

- For spell checking
#+BEGIN_SRC emacs-lisp
  (setq ispell-program-name "aspell") ; could be ispell as well, depending on your preferences
  (setq ispell-dictionary "british") ; this can obviously be set to any language your spell-checking program supports
  (customize-set-variable 'ispell-extra-args '("--sug-mode=ultra"))
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  ; (add-hook 'LaTeX-mode-hook 'flyspell-buffer)
  ; (add-hook 'org-mode-hook 'flyspell-mode)
  ; (add-hook 'org-mode-hook 'flyspell-buffer)
#+END_SRC

** Fix-word

#+BEGIN_SRC emacs-lisp
  (use-package fix-word
    :bind (("M-u" . #'fix-word-upcase)
	   ("M-l" . #'fix-word-downcase)
	   ("M-c" . #'fix-word-capitalize)))
#+END_SRC

** Highlight Indentation

- To highlight indentations
  - Options are fill, column, and character
  - There's no way to get indentation on empty lines as of now

#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
  (setq highlight-indent-guides-method 'character)
#+END_SRC
** Web mode

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(setq web-mode-markup-indent-offset 2)
#+END_SRC

** magit

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :pin nongnu ; installation issues with melpa
    )
#+END_SRC

* LISP
** SLIME

#+BEGIN_SRC emacs-lisp
  ;; (setq inferior-lisp-program (executable-find "sbcl"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; (defun sort-lines-by-length (reverse beg end)
  ;;   "Sort lines by length."
  ;;   (interactive "P\nr")
  ;;   (save-excursion
  ;;     (save-restriction
  ;;       (narrow-to-region beg end)
  ;;       (goto-char (point-min))
  ;;       (let ;; To make `end-of-line' and etc. to ignore fields.
  ;;           ((inhibit-field-text-motion t))
  ;;         (sort-subr reverse 'forward-line 'end-of-line nil nil
  ;;                    (lambda (l1 l2)
  ;;                      (apply #'< (mapcar (lambda (range) (- (cdr range) (car range)))
  ;;                                         (list l1 l2)))))))))
#+END_SRC

** Racket

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/manualPackages/emacs-ob-racket")
  (add-to-list 'org-src-lang-modes '("racket" . racket))
    (org-babel-do-load-languages
   'org-babel-load-languages
   '((racket . t)))
#+END_SRC

* Python (disabled)

#+BEGIN_SRC emacs-lisp
  ; (elpy-enable)
  ;; (require 'python-mode)

  ;; (require 'py-autopep8)
  ;; (add-hook 'python-mode-hook 'py-autopep8-enable-on-save)

  ;(defun my/python-mode-hook ()
  ;  (add-to-list 'company-backends 'company-jedi))
  ;
  ;(add-hook 'python-mode-hook 'my/python-mode-hook)
#+END_SRC

* Testing

** flycheck

#+BEGIN_SRC emacs-lisp
 (use-package flycheck
    :diminish flycheck-mode
    :init
    (global-flycheck-mode))
#+END_SRC

