config.el

(setq ispell-program-name "aspell") ; could be ispell as well, depending on your preferences
(setq ispell-dictionary "british") ; this can obviously be set to any language your spell-checking program supports
(customize-set-variable 'ispell-extra-args '("--sug-mode=ultra"))
(add-hook 'LaTeX-mode-hook 'flyspell-mode)
; (add-hook 'LaTeX-mode-hook 'flyspell-buffer)
; (add-hook 'org-mode-hook 'flyspell-mode)
; (add-hook 'org-mode-hook 'flyspell-buffer)

(require 'fix-word)
(global-set-key (kbd "M-u") #'fix-word-upcase)
(global-set-key (kbd "M-l") #'fix-word-downcase)
(global-set-key (kbd "M-c") #'fix-word-capitalize)

(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
(setq highlight-indent-guides-method 'character)

(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(setq web-mode-markup-indent-offset 2)

;; (setq inferior-lisp-program (executable-find "sbcl"))

;; (defun sort-lines-by-length (reverse beg end)
;;   "Sort lines by length."
;;   (interactive "P\nr")
;;   (save-excursion
;;     (save-restriction
;;       (narrow-to-region beg end)
;;       (goto-char (point-min))
;;       (let ;; To make `end-of-line' and etc. to ignore fields.
;;           ((inhibit-field-text-motion t))
;;         (sort-subr reverse 'forward-line 'end-of-line nil nil
;;                    (lambda (l1 l2)
;;                      (apply #'< (mapcar (lambda (range) (- (cdr range) (car range)))
;;                                         (list l1 l2)))))))))

(add-to-list 'load-path "~/.emacs.d/manualPackages/emacs-ob-racket")
(add-to-list 'org-src-lang-modes '("racket" . racket))
  (org-babel-do-load-languages
 'org-babel-load-languages
 '((racket . t)))

; (elpy-enable)
;; (require 'python-mode)

;; (require 'py-autopep8)
;; (add-hook 'python-mode-hook 'py-autopep8-enable-on-save)

;(defun my/python-mode-hook ()
;  (add-to-list 'company-backends 'company-jedi))
;
;(add-hook 'python-mode-hook 'my/python-mode-hook)
